# KipDashFtPerDegree Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KipDashFtPerDegree Property
SymbolTypeId Class See Also
---
Symbol kip-ft/°, indicating unit Kip feet per degree.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipDashFtPerDegree { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipDashFtPerDegree As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipDashFtPerDegree {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace